{
    "filepath": "./posts/software-development-at-zomato-kKa08C/post.json",
    "href": "/home/gnsp/Code/Experimental/organizeBlog/newblog/posts/software-development-at-zomato-kKa08C/index.html",
    "cover_image": false,
    "created": "July 17, 2017",
    "modified": "July 17, 2017",
    "published": true,
    "categories": [
        "programming"
    ],
    "content": "<p>It has been almost 2 months since I first found myself employed and working fulltime on something I liked and cared\nabout; in short I have been coding for last 2 months with a bunch of awesome people who like coding new stuff on a rather\ndaily basis. In this post I&#39;ll outline this awesome experience and a little bit of backstory to it.</p>\n<p>Previously I was officially unemployed, working mostly on my own pet projects like <a href=\"https://npmjs.com/package/ghournal\">Ghournal</a>\nand <a href=\"https://npmjs.com/package/ironscript\">Ironscript</a> and freelancing sometimes for little money. Then I got employed as\na software development engineer at <a href=\"https://zomato.com\">Zomato</a> and joined the job about 2 months ago. Since then, life\nhas been a little different than what it used to be. The main difference being, here I am not an individual developer\nwith my own agenda anymore, here I am a part of a team and we collaborate. The idea of responsibility is a bit different\nin this scenario. For instance, when I was an individual developer working on Ironscript, I used to care little about\nbackward compatibility, but here because the softwares we develop are rather complex ones with a lot of dependencies,\nupgrading something blindly may actually break some parts of the software. And as a matter of fact, I came to realise\nthat we do not exactly need to upgrade everytime a new (read trending) technology comes in. If the software works well\nand is performant, then upgrading it blindly just to take &#39;advantage&#39; of some new technology may not be that good an idea.\nAnother important thing I noticed is that, it&#39;s better and more efficient to take an evolutionary approach to software\ndevelopment than a properly planned and static development model. Firstly it speeds things up and always keeps you on\nyour toes. Secondly it&#39;s easier to deliver better software when the client can actually evaluate a working copy of the\nsoftware and point out which things neeed to change and what new features they want. The evolutionary approach does\ndecrease the communication gap between the developer and the client.</p>\n<p>So much for the general experience, let&#39;s talk about the things I am working on here. It&#39;s mostly React and React-native.\nYeah, React is one of the best things around at this moment and it&#39;s here to stay. A lot of people are moving to React.\nMy first assignment here was to add some new features and fix a few bugs in an existing app written using React-native.\nI had some previous experience with React, so I had a rather easy time understanding the existing codebase and working\nwith it. Then I was assigned to develop the frontend for our Recommendations System (which is currently under development)\nso that we can visualize and test the same, I prefered to do it using React and I did the same. Nowadays I am working with\nboth the projects and leveling up my skills with React and Redux. It certainly has been an awesome experience.</p>\n",
    "abstract": "It has been almost 2 months since I first found myself employed and working fulltime on something I liked and cared\nabout; in short I have been coding for last 2 months with a bunch of awesome people who like coding new stuff on a rather\ndaily basis.<span class=\"ellipsis\">...</span>",
    "title": "Software Development At Zomato",
    "date": "July 17, 2017",
    "id": "software-development-at-zomato-kKa08C"
}