{
    "filepath": "./posts/dailydigest-3-may-16/post.json",
    "title": "A Little Bit-Hack",
    "abstract": "An useful technique to reverse the bits on an unsigned integer using bitwise operations only. This technique works in O(log n), where n is the number of bits in the unsigned interger datatype.",
    "created": "3rd May, 2016",
    "modified": "3rd May, 2016",
    "published": true,
    "categories": [
        "DailyDigest",
        "Coding"
    ],
    "content": "<p>Today I&#39;ll explain, with examples, an efficient technique to reverse the bits of an unsigned integer. Though this technique can be implemented in any programming language with little or no variations, in this post we will consider only the languages with fixed width unsigned integer types, like C, C++ and Java. The examples will be given in C. So, let&#39;s get to the hack.</p>\n\n<h3>Problem Statement</h3>\n\n<p>Given an unsigned integer of <code>n</code> bits (<code>n</code> can be 8 or 16 or 32 or 64 or any power of 2) reverse its bit pattern in <code>O(log n)</code> worst case time complexity. For instance if <code>n = 8</code> and the unsigned integer in binary is <code>1011 0010</code> then after bit reversal, the binary representation of the integer should be <code>0100 1101</code>.</p>\n\n<h3>Analysis</h3>\n\n<p>An intuitive and simple approach would be to iterate through the individual bits of the integer, push them to a stack and then pop the stack empty to generate the number with the bit pattern reversed. But that&#39;s an <code>O(n)</code> approach. We need to reduce the worst case time complexity to <code>O(log n)</code>. </p>\n\n<p>Most of the time when we need to reduce an <code>O(n)</code> solution to <code>O(log n)</code>, we look for divide-and-conquer strategies. Here also, we will try and employ this divide and conquer strategy to reverse the bit pattern in <code>O(log n)</code>. Let&#39;s take the number in the example cited in the problem, <code>1011 0010</code> and analyse its reversal.</p>\n\n<p>I will use the following conventions throughout this post.</p>\n\n<pre><code>The lowest significant bit (LSB) of the pattern is indexed 0.\nExample\n\n  +---------------+---+---+---+---+---+---+---+---+\n  |   Bit Value   | 1 | 0 | 1 | 1 | 0 | 0 | 1 | 0 |\n  +---------------+---+---+---+---+---+---+---+---+\n  |   Index       | 7 | 6 | 5 | 4 | 3 | 2 | 1 | 0 |\n  +---------------+---+---+---+---+---+---+---+---+\n\nreverse(X) :    bit-pattern X reversed, e.g. if X=1011, reverse(X)=1101\nX[i:j] :        bit-i(inclusive) to bit-j(inclusive) of a bit-pattern X. e.g. if X=1101, X[2:0]=101\nX+Y :           concatenate bit-patterns X and Y</code></pre>\n\n<p>Now, let <code>X = 1011 0010</code>.<br/>Clearly <code>reverse(X) = reverse(X[3:0]) + reverse(X[7:4])</code>\nand <code>reverse(X[3:0]) = reverse(X[1:0]) + reverse(X[3:2])</code>\nand <code>reverse(X[7:4]) = reverse(X[5:4]) + reverse(X[7:6])</code></p>\n\n<p>Literally we what we are doing is that, we are dividing the 8 bits to groups of 4 consecutive bits, then we are reversing the 4 bits by dividing them to 2 bits each recursively, then we are concatenating the 4-bits groups in reverse order.</p>\n\n<p>Generalising for <code>n</code> bits, the strategy is the divide them into 2 groups of <code>n/2</code> consecutive bits each, reverse them and concatenate them in reverse order. The condition for termination of this recursive strategy is that when <code>n==1</code>, the reversed pattern is same as the original pattern.</p>\n\n<h3>Implementation using bitwise operations only</h3>\n\n<p>For our above strategy to work, we need two mechanisms, 1. Select n consecutive bits of a pattern, 2. Swap 2 groups of n bits each. Interestingly we can do both of these things very efficiently using bitwise ops.</p>\n\n<p>Selecting a number of bits from a bit pattern is as simple as creating a bit-mask for those bits and applying the mask to the original pattern using <code>AND</code>, For example if I wanted to select bits 7 to 4 in the pattern <code>1011 0010</code>, I can use the mask <code>1111 0000</code> (Notice that the mask has 1s for bits I want to select and 0s for bits I want to ignore). The selection is <code>0b10110010 &amp; 0b11110000 = 0b10110000</code> (<code>0b</code> is prefix for binary representation in C).</p>\n\n<p>Swapping can be done by selecting alternate groups and shifting them in opposite directions before joining them using <code>OR</code>. The process would be clear with a bit of code. Below is the function that reverses the bits of an 8-bit unsigned integer in C.</p>\n\n<pre><code>unsigned char bitReverse(unsigned char num) {\n  num = (num &amp; 0xf0) &gt;&gt; 4 | (num &amp; 0x0f) &lt;&lt; 4;  // Select 4 bit groups and swap them\n  num = (num &amp; 0xcc) &gt;&gt; 2 | (num &amp; 0x33) &lt;&lt; 2;  // Select 2-bit groups and swap them\n  num = (num &amp; 0xaa) &gt;&gt; 1 | (num &amp; 0x55) &lt;&lt; 1;  // Select alternate bits and swap\n\n  return num; // now the bit pattern in num has been reversed\n}</code></pre>\n\n<h3>A detailed explanation</h3>\n\n<p>Now I will explain what this piece of code does, line by line. Let&#39;s take <code>num = 1101 0110</code>.<br/>In the first line, <code>num = (num &amp; 0xf0) &gt;&gt; 4 | (num &amp; 0x0f) &lt;&lt; 4;</code>,  we do 5 things. We can rewrite the first line as the following for the sake of clarity :</p>\n\n<pre><code>// Now num is 1101 0110\nunsigned int leftFourBits = num &amp; 0xf0; \n// leftFourBits = 1101 0110 &amp; 1111 0000 = 1101 0000\n\nunsigned int rightFourBits = num &amp; 0x0f;\n// rightFourBits = 1101 0110 &amp; 0000 1111 = 0000 0110\n\nunsigned int leftGroupShifted4BitsRight = leftFourBits &gt;&gt; 4;\n// leftGroupShifted4BitsRight = 1101 0000 &gt;&gt; 4 = 0000 1101\n\nunsigned int rightGroupShifted4BitsLeft = rightFourBits &lt;&lt; 4;\n// rightGroupShifted4BitsLeft = 0000 0110 &lt;&lt; 4 = 0110 0000\n\n// Now we have the left group on the right and the right group on the left, on two different variables\n// We can OR those two variables to effectively swap the 4 bit groups\n\nnum = leftGroupShifted4BitsRight | rightGroupShifted4BitsLeft\n// num = 0110 0000 | 0000 1101 = 0110 1101\n// See, now in num, the left and right 4 bits are swapped</code></pre>\n\n<p>Similarly we swap 2-bit groups and then alternate individual bits. For selecting alternate 2 bits groups we use <code>1100 1100 (0xcc)</code> and <code>0011 0011 (0x33)</code> as masks, the rest of the procedure is same, we shift them 2 bits to right and left respectively and we <code>OR</code> them to get the new num. Then we do the same method taking 1 bit at a time by using masks <code>1010 1010 (0xaa)</code> and <code>0101 0101 (0x55)</code> to swap alternate bits. After this, we have the bit pattern completely reversed.</p>\n\n<p>For higher values of <code>n</code> (here we had taken only 8 bit patterns, <code>n==8</code>) the same technique holds, just we have to find the respective bit masks. This technique reverses the bits in <code>O(log n)</code> worst case time complexity.</p>"
}